app/controllers/books_controller.rb

SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "k"], ["body", "k"], ["created_at", "2020-01-16 02:49:19.922048"], ["updated_at", "2020-01-16 02:49:19.922048"]]
---
  def create
    @books = Book.all
    @book = Book.new(book_params)
    if @book.save

SELECT "books".* FROM "books"
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "fj"], ["body", "jf"], ["updated_at", "2020-01-16 10:17:21.496692"], ["id", 1]]
---
  def update
    @books = Book.all
    @book = Book.find(params[:id])
    if @book.update(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 126], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 132]]
---
  def destroy
  	@book = Book.find(params[:id])
    @book.destroy